
public class Main {
	
	/* 5월 8일(월) ~ 5월 14일(일) 회고록
	 * 
	 * 이번 주는 인터셉터, AOP 등에 대해 배웠다.
	 * 인터셉터, AOP는 결이 비슷한 것 같다. 
	 * 인터셉터를 알고 AOP를 공부하니 그리 어렵게 느껴지지 않았다.
	 * 
	 * 이것들을 내가 자동으로 활용할 수 있을 때까지
	 * 열심히 공부해야겠다.
	 * 
	 * 근데 금요일에 몸이 조금 으슬으슬하더니 결국 독감에 걸린 것 같다.
	 * 어제(토요일)은 정말 종일 누워있었다. 몸 관리를 철저히 했어야 했는데,
	 * 스스로의 컨디션을 챙기지 못한 나의 잘못이다.
	 * 반성하고 공부도 공부지만, 몸 관리 열심히 해야겠다.
	 * 
	 * 파이널 프로젝트 조도 정해졌다.
	 * 원래 암묵적으로 함께 하기로 한 팀이 있었지만,
	 * 
	 * 다른 결의 팀원들과 협업하면서 새로운 도전을 해보고 싶었기 때문에
	 * 정중히 양해를 구하고 새로운 팀에 속하게 되었다.
	 * '내가 잘하고 있는건가?' 라는 생각이 들 정도로 
	 * 여기저기 스카우트가 와서 기분이 정말 좋았다.
	 * 
	 * 실망하지 않도록 열심히 해봐야겠다~
	 * 일단 내가 이번주 내로 유스케이스 다이어그램을 다 만들고
	 * 프로젝트 협업에 사용될 노션(Notion)에 대해 공부하기로 선언했기 때문에
	 * 몸이 좀 안좋지만, 열심히 해보이겠다.
	 * 
	 * 오늘도 최정원 화이팅!
	 * 
	 */
}
